/*
    TASK 1
    Вывести 10 строчек со смайликом : ':)'. 
    На первой строчке один смайлик, на второй два,и так далее. 
    На последней должно быть 10 смайликов.   
    
*/
let smile = ':)';
for (i = 0; i < 10; i ++){
    console.log(smile.repeat(i+1))
}



/* 
    TASK 2
    У нас есть число 1000
    Делите его на 2 столько раз, пока результат деления не станет меньше 50.
    Посчитайте количество итераций необходимых для выхода из цикла 
    и выведите результат в консоль

*/
let n = 0;
while (1000 / (2** (n + 1)) >= 50){
    n ++;
    }
console.log(n)



/*
    TASK 3
    Вывести в консоль с помощью цикла FOR, все четные числа от 70 до 40.
    Первым четным числом должно быть 70. 
    
*/
for (i = 71; i >= 40; i --){
    if (i % 2 === 0){
        console.log(i);
    }
}



/*
    TASK 4

    С помощью любого известного Вам цикла из JavaScript, 
    найдите сумму чисел от 1 до 100, и выведите результат в консоль.   
    
*/
let sum = 0;
for (i = 0; i < 100; i ++){
    sum = sum + (i + 1);
}
console.log(sum)